JAVA/JenkovTutorial/src/main/java/xml/input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bcs="http://www.huawei.com/bme/cbsinterface/bcservices" xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon" xmlns:bcc="http://www.huawei.com/bme/cbsinterface/bccommon">
   <soapenv:Header/>
   <soapenv:Body>
      <bcs:QueryCustomerInfoRequestMsg>
         <RequestHeader>
            <cbs:Version>1.0</cbs:Version>
            <!--Optional:-->
            <cbs:BusinessCode>QueryCustomerInfo</cbs:BusinessCode>
            <cbs:MessageSeq>${=(new java.text.SimpleDateFormat("yyyyMMddHHmmss")).format(new Date())}${=(int)(Math.random()*1000)}</cbs:MessageSeq>
            <!--Optional:-->
            <cbs:OwnershipInfo>
               <cbs:BEID>101</cbs:BEID>
            </cbs:OwnershipInfo>
            <cbs:AccessSecurity>
               <cbs:LoginSystemCode>wx500922</cbs:LoginSystemCode>
               <cbs:Password>Ua0tfLDGN2PcEgRIWc7FccbRkYMeeANF+47CcF/4dtrBYwCAX1TE</cbs:Password>
            </cbs:AccessSecurity>
            <!--Optional:-->
            <cbs:OperatorInfo>
               <cbs:OperatorID>101</cbs:OperatorID>
            </cbs:OperatorInfo>
            <!--Optional:-->
            <cbs:AccessMode>3</cbs:AccessMode>
            <!--Optional:-->
            <cbs:MsgLanguageCode>2002</cbs:MsgLanguageCode>
            <!--Optional:-->
            <cbs:TimeFormat>
               <cbs:TimeType>1</cbs:TimeType>
            </cbs:TimeFormat>
         </RequestHeader>
         <QueryCustomerInfoRequest>
            <bcs:QueryObj>
            <bcs:CustAccessCode>
                  <!--You have a CHOICE of the next 3 items at this level-->
                  <bcc:PrimaryIdentity>9791001617</bcc:PrimaryIdentity>
               </bcs:CustAccessCode>
            </bcs:QueryObj>
            <!--Optional:-->
            <bcs:QueryMode>2</bcs:QueryMode>
         </QueryCustomerInfoRequest>
      </bcs:QueryCustomerInfoRequestMsg>
   </soapenv:Body>
</soapenv:Envelope>
